README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org05a6324">1. Working towards an open source comp sci education.</a></li>
<li><a href="#org423c1ed">2. Curriculum and completion status:</a>
<ul>
<li><a href="#org83db4ac">2.1. Core programming</a></li>
<li><a href="#org57337d2">2.2. Core math</a></li>
<li><a href="#orgc112609">2.3. Core systems</a></li>
<li><a href="#orgf27e79f">2.4. Core theory</a></li>
<li><a href="#orgd440a73">2.5. Core applications</a></li>
</ul>
</li>
</ul>
</div>
</div>

<a id="org05a6324"></a>

# Working towards an open source comp sci education.

Following the courses laid out here: [<https://github.com/open-source-society/computer-science>]


<a id="org423c1ed"></a>

# Curriculum and completion status:


<a id="org83db4ac"></a>

## Core programming

Topics covered: functional programming design for testing program requirements common design patterns unit testing object-oriented design Java static typing dynamic typing ML-family languages (via Standard ML) Lisp-family languages (via Racket) Ruby and more

-   [ ] How to Code - Simple Data 	7 weeks 	8-10 hours/week
-   [ ] How to Code - Complex Data 	6 weeks 	8-10 hours/week
-   [ ] Software Construction - Data Abstraction 	6 weeks 	8-10 hours/week
-   [ ] Software Construction - Object-Oriented Design 	6 weeks 	8-10 hours/week
-   [ ] Programming Languages, Part A 	4 weeks 	8-16 hours/week
-   [ ] Programming Languages, Part B 	3 weeks 	8-16 hours/week
-   [ ] Programming Languages, Part C 	3 weeks 	8-16 hours/week


<a id="org57337d2"></a>

## Core math

Topics covered: linear transformations matrices vectors mathematical proofs number theory differential calculus integral calculus sequences and series discrete mathematics basic statistics O-notation graph theory vector calculus discrete probability and more

-   [ ] Linear Algebra - Foundations to Frontiers (alt) 	15 weeks 	8 hours/week
-   [ ] Calculus One 	16 weeks 	8-10 hours/week
-   [ ] Calculus Two: Sequences and Series 	7 weeks 	9-10 hours/week
-   [ ] Mathematics for Computer Science 	13 weeks 	5 hours/week


<a id="orgc112609"></a>

## Core systems

Topics covered: boolean algebra gate logic memory machine language computer architecture assembly machine language virtual machines high-level languages compilers operating systems network protocols and more

-   [ ] Build a Modern Computer from First Principles: From Nand to Tetris (alt) 	6 weeks 	7-13 hours/week
-   [ ] Build a Modern Computer from First Principles: Nand to Tetris Part II 	6 weeks 	12-18 hours/week
-   [ ] Introduction to Computer Networking 	8 weeks 	4–12 hours/week


<a id="orgf27e79f"></a>

## Core theory

Topics covered: divide and conquer sorting and searching randomized algorithms graph search shortest paths data structures greedy algorithms minimum spanning trees dynamic programming NP-completeness and more

-   [ ] Algorithms (1/4)1 	4 weeks 	4-8 hours/week
-   [ ] Algorithms (2/4)1 	4 weeks 	4-8 hours/week
-   [ ] Algorithms (3/4) 	4 weeks 	4-8 hours/week
-   [ ] Algorithms (4/4) 	4 weeks 	4-8 hours/week


<a id="orgd440a73"></a>

## Core applications

Topics covered: Agile methodology REST software specifications refactoring relational databases transaction processing data modeling neural networks supervised learning unsupervised learning OpenGL raytracing block ciphers authentication public key encryption and more

-   [ ] Databases 	12 weeks 	8-12 hours/week
-   [ ] Machine Learning 	11 weeks 	4-6 hours/week
-   [ ] Computer Graphics 	6 weeks 	12 hours/week
-   [ ] Cryptography I 	6 weeks 	5-7 hours/week
-   [ ] Software Engineering: Introduction 	6 weeks 	8-10 hours/week
-   [ ] Software Development Capstone Project 	6-7 weeks 	8-10 hours/week
